[
    {
        "text": "Oh, I just LOVE waiting on hold for an hour. Best part of my day!",
        "sarcasm": 1
    },
    {
        "text": "The representative was quick and helpful, solved my issue in minutes.",
        "sarcasm": 0
    },
    {
        "text": "Wow, this phone battery lasts a whole 2 hours. So impressive!",
        "sarcasm": 1
    },
    {
        "text": "The laptop performance is smooth, and the battery lasts all day.",
        "sarcasm": 0
    },
    {
        "text": "Oh sure, this update definitely didn’t crash my entire system. Great job!",
        "sarcasm": 1
    },
    {
        "text": "The latest software update improved speed and security.",
        "sarcasm": 0
    },
    {
        "text": "Oh, traffic jams are the BEST! Who doesn’t love being stuck for hours?",
        "sarcasm": 1
    },
    {
        "text": "The roads were clear, and I reached my destination in no time.",
        "sarcasm": 0
    },
    {
        "text": "This movie was just *amazing*! I totally didn't fall asleep halfway through.",
        "sarcasm": 1
    },
    {
        "text": "The movie was engaging, and the storyline kept me hooked.",
        "sarcasm": 0
    },
    {
        "text": "Oh great, another meeting that could’ve been an email. My favorite!",
        "sarcasm": 1
    },
    {
        "text": "The meeting was productive, and we resolved key issues.",
        "sarcasm": 0
    },
    {
        "text": "Wow, this pizza is totally not burnt. Love the crunchy charcoal taste!",
        "sarcasm": 1
    },
    {
        "text": "The pizza was fresh, with a perfect balance of cheese and toppings.",
        "sarcasm": 0
    },
    {
        "text": "Oh fantastic, my package arrived… three weeks late. Just what I wanted!",
        "sarcasm": 1
    },
    {
        "text": "The delivery was fast, and the packaging was secure.",
        "sarcasm": 0
    },
    {
        "text": "Oh, another influencer telling me what to buy. So authentic!",
        "sarcasm": 1
    },
    {
        "text": "This influencer’s recommendation was spot on! Loved the product.",
        "sarcasm": 0
    }
]